app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
      if @comment.save
---
INSERT INTO `comments` (`content`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('test1', 1, 3, '2023-01-18 07:09:55.931584', '2023-01-18 07:09:55.931584')