app/controllers/prototypes_controller.rb

UPDATE `prototypes` SET `prototypes`.`updated_at` = '2023-01-17 06:43:35.865070' WHERE `prototypes`.`id` = 2
---
  def create
    @prototype = Prototype.create(prototypes_params)
    if @prototype.save