app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def create
    @prototype = Prototype.new(prototypes_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('sample', 'sample1', 'sample1', 2, '2023-01-19 08:45:09.316675', '2023-01-19 08:45:09.316675')

  def show
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1

  def edit
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1

  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototypes_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 6 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`concept` = 'test2-1', `prototypes`.`updated_at` = '2023-01-18 07:33:28.273248' WHERE `prototypes`.`id` = 5

  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1

  def move_to_index
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1